Revit 2027 API
CompoundStructure.GetRegionEnvelope Method
 Gets the envelope that a specified region spans.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public BoundingBoxUV GetRegionEnvelope(
	int regionId
)
Public Function GetRegionEnvelope (
	regionId As Integer
) As BoundingBoxUV
public:
BoundingBoxUV^ GetRegionEnvelope(
	int regionId
)
member GetRegionEnvelope :
        regionId : int -> BoundingBoxUV
Parameters
regionId Int32
 The id of the region.
Return Value
BoundingBoxUV
 The envelope of the region.
Exceptions
Exception | Condition
ArgumentException |  It is not a valid region id.
InvalidOperationException |  This operation is valid only for vertically compound structures.
Remarks
 This envelope indicates the external boundary of the region. The coordinate system it defines is used in the results of GetSegmentCoordinate().
See Also
Reference
CompoundStructure Class
Autodesk.Revit.DB Namespace